
hello_on_start = 'Привет! ✋ Я бот-калькулятор.\n\nПосчитаю для тебя выражения типа:\n(34/2-15)xx3 или 16x19-177\n\n' \
                 'Также я обрабатываю голосовые сообщения (thx Google Speech API)\n' \
                 '"144-27+6-33-7.5"\n"5% от 169"\n"корень степени N из A"\n\nПопробуй!'

help_text = 'Слева от поля ввода внизу есть меню, там можно найти список команд\n' \
            'У меня 3 режима ввода:\n\n' \
            '💬 голосовой - присылай мне аудиосообщения типа "37% от 42" или "квадратный корень из 256" ' \
            'или просто "3 в степени 4 разделить на 25 - 6" или "ответ умножить на 6 плюс 2000"\n\n' \
            '🔢 мои удобные кнопки - специально для тебя. Их можно вызвать из меню (или) командой /keys\n\n' \
            '🥥 и простой ввод в поле для сообщения с помощью стандартной клавиатуры\n\n' \
            '👆 коснитесь результата вычисления, чтобы моментально скопировать его' \
            'Список арифметических операторов можно уточнить командой /arithmetics\n\n' \
            '🧷 оставь свой отзыв или предложение для @shigarovms с помощью команды /support\n\n' \
            'P.S.\nЗнаешь, почему делить на ноль нельзя?'

keys_text = '👉` начни ввод с `*+*` , `*-*` , `*x*` или `*/*` `, ' \
            'чтобы сделать результат предыдущего вычисления первым числом'

arithmetics_help_text = '`  + ` сложение\n' \
                        '`  - ` вычитание\n' \
                        '`  x ` умножение\n' \
                        '`  / ` деление\n' \
                        '` xx ` возведение в степень\n' \
                        '` // ` целочисленное деление\n' \
                        '`  % ` остаток от деления\n' \
                        '`Axx(Nxx-1)` корень степени N из A\n'

# zero_div_text = 'делить на ноль нельзя! не я это придумал 😁'

no_hack_text = 'Хорошая попытка, мистер хакер! Но меня так легко не выключить.'

support_is_on = '/support активирован\n' \
                'Пришли или перешли текстовое сообщение для нас (@shigarovms)\n' \
                'завершить - /support'

support_is_off = 'Большое спасибо за обращение!\n' \
                 '/support завершен'

zero_division_text = 'Сколько нулей не складывай, делимое мы не получим.\nПоэтому говорят, что делить на ноль нельзя 😁'
